iTunes/app/controllers/albums_controller.rb

  def create
    @album = Album.new(album_params)

    @album.save
---
INSERT INTO "albums" ("title", "artist", "year", "album_art", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)