iTunes/app/controllers/songs_controller.rb

    def create
        @album = Album.find(params[:album_id])
        @song = @album.songs.create(song_params)
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "songs" ("name", "genre", "duration", "album_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Hot Night"], ["genre", "Funk"], ["duration", 1.45], ["album_id", 1], ["created_at", "2020-04-20 20:55:07.089495"], ["updated_at", "2020-04-20 20:55:07.089495"]]