iTunes/app/views/albums/show.html.erb


<% @album.songs.each do |song|%>
---
SELECT "songs".* FROM "songs" WHERE "songs"."album_id" = ?  [["album_id", 4]]